In [7]:
import pandas as pd

df = pd.read_csv("example.csv", sep=',')
df

       name  age
0     Alice   25
1       Bob   30
2   Charlie   28
3     David   35
4      Emma   29
5     Frank   31
6     Grace   27
7     Henry   26
8      Isla   32
9      Jack   30
10     Kate   29
11     Liam   28
12      Mia   33
13     Noah   27
14   Olivia   31
15    Peter   28
16    Quinn   34
17     Ruby   26
18   Sophia   32
19      Tom   29
20   Ursula   31
21   Victor   27
22    Wendy   28
23   Xavier   30
24     Yara   33
25     Zane   26
26     Ella   28
27     Finn   31
28      Gia   35
29    Harry   29

In [8]:
df.describe()

             age
count  30.000000
mean   29.600000
std     2.724094
min    25.000000
25%    28.000000
50%    29.000000
75%    31.000000
max    35.000000

### Q1 (%25 percentile calculation)

In [9]:
Q1 = df.age.quantile(0.25)
Q1

28.0

### Q3 (%75 percentile calculation)

In [14]:
Q3 = df.age.quantile(0.75)
Q3

31.0

In [11]:
#Median
Q2 = df.age.quantile(0.50)
Q2

29.0

In [15]:
### Lower Limit and Upper Limit Calculation = Q3 - Q1
IQR_value

3.0

### Lower Limit and Upper Limit Calculation

In [16]:
lower_limit = Q1 - 1.5*IQR_value

In [17]:
lower_limit

23.5

In [18]:
upper_limit = Q3 + 1.5*IQR_value

In [19]:
upper_limit

35.5

### Now that we have calculated the lower and upper limits, we can find the outlier values in our dataset:

In [23]:
df[(df.age < lower_limit) | (df.age > upper_limit)]

Empty DataFrame
Columns: [name, age]
Index: []

#### These values are Outlier values. Outlier values so that our statistical calculations (and of course many artificial intelligence algorithms) can work more efficiently and effectively and produce accurate results.verisetimizden çıkaracağız..

### Removing Outlier Values from Our Dataset

In [24]:
df_outlier_filtered = df[(df.age >lower_limit) & (df.age < upper_limit)]

In [25]:
df_outlier_filtered

       name  age
0     Alice   25
1       Bob   30
2   Charlie   28
3     David   35
4      Emma   29
5     Frank   31
6     Grace   27
7     Henry   26
8      Isla   32
9      Jack   30
10     Kate   29
11     Liam   28
12      Mia   33
13     Noah   27
14   Olivia   31
15    Peter   28
16    Quinn   34
17     Ruby   26
18   Sophia   32
19      Tom   29
20   Ursula   31
21   Victor   27
22    Wendy   28
23   Xavier   30
24     Yara   33
25     Zane   26
26     Ella   28
27     Finn   31
28      Gia   35
29    Harry   29